# IsWallCrossSectionValid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wall..::..IsWallCrossSectionValid Method
Wall Class See Also
---
Checks whether the desired cross section is valid for the current wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool IsWallCrossSectionValid(
	WallCrossSection wallCrossSection
)
```

Visual Basic
---
```text
Public Function IsWallCrossSectionValid ( _
	wallCrossSection As WallCrossSection _
) As Boolean
```

Visual C++
---
```text
public:
bool IsWallCrossSectionValid(
	WallCrossSection wallCrossSection
)
```

# ### Parameters
wallCrossSection
    Type: Autodesk.Revit.DB..::..WallCrossSection The desired cross section.
# ### Return Value
True if the wall can be set to the desired cross section.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
Wall Class
Autodesk.Revit.DB Namespace